name: "CaffeNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 1 dim: 1 dim: 1 } }
}
layer {
  name: "layer"
  bottom: "data"
  top: "out"
  type: "TanH"
}
