#test_interval: 100
#test_iter: 100
test_iter: 1000
test_interval: 1000
base_lr: 0.01
lr_policy: "step"
gamma: 0.1
stepsize: 100000
display: 100000
max_iter: 450000
momentum: 0.9
weight_decay: 0.0005
snapshot: 100000
snapshot_prefix: "train"
# Display every 20 iterations
#display: 20
net_param { 
name: 'CaffeNet'
layer {
  name: 'data'
  type: 'Input'
  top: 'data'
  top: 'label'
  input_param { shape: { dim: 1 dim: 1 dim: 1 dim: 1 } }
}
layer {
  name: 'inputLayer'
  type: 'InnerProduct'
  bottom: 'data'
  top: 'inputLayer'
  inner_product_param {
    num_output: 10
    weight_filler {
      type: 'xavier'
    }
    bias_filler {
      type: 'constant'
    }
  }
}
layer {
  name: 'activatedInputLayer'
  type: 'TanH'
  bottom: 'inputLayer'
  top: 'activatedInputLayer'
}
layer {
  name: 'outputLayer'
  type: 'InnerProduct'
  bottom: 'activatedInputLayer'
  top: 'outputLayer'
  inner_product_param {
    num_output: 1
    weight_filler {
      type: 'xavier'
    }
    bias_filler {
      type: 'constant'
    }
  }
}
layer {
  name: 'activatedOutputLayer'
  type: 'TanH'
  bottom: 'outputLayer'
  top: 'activatedOutputLayer'
}
layer {
  name: 'loss'
  type: 'EuclideanLoss'
  bottom: 'activatedOutputLayer'
  bottom: 'label'
  top: 'loss'
} 
} 
